app/Controllers/Auth.php

    public function login()
    {
        $mlearner = new Learners();
        $mkampus = new Kampus();
        $mmasnager = new Manager();
        $dataLearner = $mlearner->where(array('email' => $_POST['email']))->first();
        $dataKampus = $mkampus->where(array('email' => $_POST['email']))->first();
        $dataManager = $mmasnager->where(array('email' => $_POST['email']))->first();
---
SELECT *
FROM `user_learner`
WHERE `email` = 'admin@amikompurwokerto.ac.id'
 LIMIT 1
SELECT *
FROM `user_kampus`
WHERE `email` = 'admin@amikompurwokerto.ac.id'
 LIMIT 1
SELECT *
FROM `user_manager`
WHERE `email` = 'admin@amikompurwokerto.ac.id'
 LIMIT 1